GopalSaraf/Practicals/PSDL/include/proc/pic16lf1764.inc
// Register: COG1RSIM1
#define COG1RSIM1 COG1RSIM1
COG1RSIM1                                equ 0698h
// bitfield definitions
COG1RSIM1_RSIM8_POSN                     equ 0000h
COG1RSIM1_RSIM8_POSITION                 equ 0000h
COG1RSIM1_RSIM8_SIZE                     equ 0001h
COG1RSIM1_RSIM8_LENGTH                   equ 0001h
COG1RSIM1_RSIM8_MASK                     equ 0001h
COG1RSIM1_RSIM9_POSN                     equ 0001h
COG1RSIM1_RSIM9_POSITION                 equ 0001h
COG1RSIM1_RSIM9_SIZE                     equ 0001h
COG1RSIM1_RSIM9_LENGTH                   equ 0001h
COG1RSIM1_RSIM9_MASK                     equ 0002h
COG1RSIM1_RSIM10_POSN                    equ 0002h
COG1RSIM1_RSIM10_POSITION                equ 0002h
COG1RSIM1_RSIM10_SIZE                    equ 0001h
COG1RSIM1_RSIM10_LENGTH                  equ 0001h
COG1RSIM1_RSIM10_MASK                    equ 0004h
COG1RSIM1_RSIM11_POSN                    equ 0003h
COG1RSIM1_RSIM11_POSITION                equ 0003h
COG1RSIM1_RSIM11_SIZE                    equ 0001h
COG1RSIM1_RSIM11_LENGTH                  equ 0001h
COG1RSIM1_RSIM11_MASK                    equ 0008h
COG1RSIM1_RSIM12_POSN                    equ 0004h
COG1RSIM1_RSIM12_POSITION                equ 0004h
COG1RSIM1_RSIM12_SIZE                    equ 0001h
COG1RSIM1_RSIM12_LENGTH                  equ 0001h
COG1RSIM1_RSIM12_MASK                    equ 0010h
COG1RSIM1_RSIM13_POSN                    equ 0005h
COG1RSIM1_RSIM13_POSITION                equ 0005h
COG1RSIM1_RSIM13_SIZE                    equ 0001h
COG1RSIM1_RSIM13_LENGTH                  equ 0001h
COG1RSIM1_RSIM13_MASK                    equ 0020h
COG1RSIM1_RSIM14_POSN                    equ 0006h
COG1RSIM1_RSIM14_POSITION                equ 0006h
COG1RSIM1_RSIM14_SIZE                    equ 0001h
COG1RSIM1_RSIM14_LENGTH                  equ 0001h
COG1RSIM1_RSIM14_MASK                    equ 0040h
COG1RSIM1_G1RSIM8_POSN                   equ 0000h
COG1RSIM1_G1RSIM8_POSITION               equ 0000h
COG1RSIM1_G1RSIM8_SIZE                   equ 0001h
COG1RSIM1_G1RSIM8_LENGTH                 equ 0001h
COG1RSIM1_G1RSIM8_MASK                   equ 0001h
COG1RSIM1_G1RSIM9_POSN                   equ 0001h
COG1RSIM1_G1RSIM9_POSITION               equ 0001h
COG1RSIM1_G1RSIM9_SIZE                   equ 0001h
COG1RSIM1_G1RSIM9_LENGTH                 equ 0001h
COG1RSIM1_G1RSIM9_MASK                   equ 0002h
COG1RSIM1_G1RSIM10_POSN                  equ 0002h
COG1RSIM1_G1RSIM10_POSITION              equ 0002h
COG1RSIM1_G1RSIM10_SIZE                  equ 0001h
COG1RSIM1_G1RSIM10_LENGTH                equ 0001h
COG1RSIM1_G1RSIM10_MASK                  equ 0004h
COG1RSIM1_G1RSIM11_POSN                  equ 0003h
COG1RSIM1_G1RSIM11_POSITION              equ 0003h
COG1RSIM1_G1RSIM11_SIZE                  equ 0001h
COG1RSIM1_G1RSIM11_LENGTH                equ 0001h
COG1RSIM1_G1RSIM11_MASK                  equ 0008h
COG1RSIM1_G1RSIM12_POSN                  equ 0004h
COG1RSIM1_G1RSIM12_POSITION              equ 0004h
COG1RSIM1_G1RSIM12_SIZE                  equ 0001h
COG1RSIM1_G1RSIM12_LENGTH                equ 0001h
COG1RSIM1_G1RSIM12_MASK                  equ 0010h
COG1RSIM1_G1RSIM13_POSN                  equ 0005h
COG1RSIM1_G1RSIM13_POSITION              equ 0005h
COG1RSIM1_G1RSIM13_SIZE                  equ 0001h
COG1RSIM1_G1RSIM13_LENGTH                equ 0001h
COG1RSIM1_G1RSIM13_MASK                  equ 0020h
COG1RSIM1_G1RSIM14_POSN                  equ 0006h
COG1RSIM1_G1RSIM14_POSITION              equ 0006h
COG1RSIM1_G1RSIM14_SIZE                  equ 0001h
COG1RSIM1_G1RSIM14_LENGTH                equ 0001h
COG1RSIM1_G1RSIM14_MASK                  equ 0040h

// Register: COG1FIS0
#define COG1FIS0 COG1FIS0
COG1FIS0                                 equ 0699h
// bitfield definitions
COG1FIS0_FIS0_POSN                       equ 0000h
COG1FIS0_FIS0_POSITION                   equ 0000h
COG1FIS0_FIS0_SIZE                       equ 0001h
COG1FIS0_FIS0_LENGTH                     equ 0001h
COG1FIS0_FIS0_MASK                       equ 0001h
COG1FIS0_FIS1_POSN                       equ 0001h
COG1FIS0_FIS1_POSITION                   equ 0001h
COG1FIS0_FIS1_SIZE                       equ 0001h
COG1FIS0_FIS1_LENGTH                     equ 0001h
COG1FIS0_FIS1_MASK                       equ 0002h
COG1FIS0_FIS2_POSN                       equ 0002h
COG1FIS0_FIS2_POSITION                   equ 0002h
COG1FIS0_FIS2_SIZE                       equ 0001h
COG1FIS0_FIS2_LENGTH                     equ 0001h
COG1FIS0_FIS2_MASK                       equ 0004h
COG1FIS0_FIS3_POSN                       equ 0003h
COG1FIS0_FIS3_POSITION                   equ 0003h
COG1FIS0_FIS3_SIZE                       equ 0001h
COG1FIS0_FIS3_LENGTH                     equ 0001h
COG1FIS0_FIS3_MASK                       equ 0008h
COG1FIS0_FIS4_POSN                       equ 0004h
COG1FIS0_FIS4_POSITION                   equ 0004h
COG1FIS0_FIS4_SIZE                       equ 0001h
COG1FIS0_FIS4_LENGTH                     equ 0001h
COG1FIS0_FIS4_MASK                       equ 0010h
COG1FIS0_FIS5_POSN                       equ 0005h
COG1FIS0_FIS5_POSITION                   equ 0005h
COG1FIS0_FIS5_SIZE                       equ 0001h
COG1FIS0_FIS5_LENGTH                     equ 0001h
COG1FIS0_FIS5_MASK                       equ 0020h
COG1FIS0_FIS6_POSN                       equ 0006h
COG1FIS0_FIS6_POSITION                   equ 0006h
COG1FIS0_FIS6_SIZE                       equ 0001h
COG1FIS0_FIS6_LENGTH                     equ 0001h
COG1FIS0_FIS6_MASK                       equ 0040h
COG1FIS0_FIS7_POSN                       equ 0007h
COG1FIS0_FIS7_POSITION                   equ 0007h
COG1FIS0_FIS7_SIZE                       equ 0001h
COG1FIS0_FIS7_LENGTH                     equ 0001h
COG1FIS0_FIS7_MASK                       equ 0080h
COG1FIS0_G1FIS0_POSN                     equ 0000h
COG1FIS0_G1FIS0_POSITION                 equ 0000h
COG1FIS0_G1FIS0_SIZE                     equ 0001h
COG1FIS0_G1FIS0_LENGTH                   equ 0001h
COG1FIS0_G1FIS0_MASK                     equ 0001h
COG1FIS0_G1FIS1_POSN                     equ 0001h
COG1FIS0_G1FIS1_POSITION                 equ 0001h
COG1FIS0_G1FIS1_SIZE                     equ 0001h
COG1FIS0_G1FIS1_LENGTH                   equ 0001h
COG1FIS0_G1FIS1_MASK                     equ 0002h
COG1FIS0_G1FIS2_POSN                     equ 0002h
COG1FIS0_G1FIS2_POSITION                 equ 0002h
COG1FIS0_G1FIS2_SIZE                     equ 0001h
COG1FIS0_G1FIS2_LENGTH                   equ 0001h
COG1FIS0_G1FIS2_MASK                     equ 0004h
COG1FIS0_G1FIS3_POSN                     equ 0003h
COG1FIS0_G1FIS3_POSITION                 equ 0003h
COG1FIS0_G1FIS3_SIZE                     equ 0001h
COG1FIS0_G1FIS3_LENGTH                   equ 0001h
COG1FIS0_G1FIS3_MASK                     equ 0008h
COG1FIS0_G1FIS4_POSN                     equ 0004h
COG1FIS0_G1FIS4_POSITION                 equ 0004h
COG1FIS0_G1FIS4_SIZE                     equ 0001h
COG1FIS0_G1FIS4_LENGTH                   equ 0001h
COG1FIS0_G1FIS4_MASK                     equ 0010h
COG1FIS0_G1FIS5_POSN                     equ 0005h
COG1FIS0_G1FIS5_POSITION                 equ 0005h
COG1FIS0_G1FIS5_SIZE                     equ 0001h
COG1FIS0_G1FIS5_LENGTH                   equ 0001h
COG1FIS0_G1FIS5_MASK                     equ 0020h
COG1FIS0_G1FIS6_POSN                     equ 0006h
COG1FIS0_G1FIS6_POSITION                 equ 0006h
COG1FIS0_G1FIS6_SIZE                     equ 0001h
COG1FIS0_G1FIS6_LENGTH                   equ 0001h
COG1FIS0_G1FIS6_MASK                     equ 0040h
COG1FIS0_G1FIS7_POSN                     equ 0007h
COG1FIS0_G1FIS7_POSITION                 equ 0007h
COG1FIS0_G1FIS7_SIZE                     equ 0001h
COG1FIS0_G1FIS7_LENGTH                   equ 0001h
COG1FIS0_G1FIS7_MASK                     equ 0080h

// Register: COG1FIS1
#define COG1FIS1 COG1FIS1
COG1FIS1                                 equ 069Ah
// bitfield definitions
COG1FIS1_FIS8_POSN                       equ 0000h
COG1FIS1_FIS8_POSITION                   equ 0000h
COG1FIS1_FIS8_SIZE                       equ 0001h
COG1FIS1_FIS8_LENGTH                     equ 0001h
COG1FIS1_FIS8_MASK                       equ 0001h
COG1FIS1_FIS9_POSN                       equ 0001h
COG1FIS1_FIS9_POSITION                   equ 0001h
COG1FIS1_FIS9_SIZE                       equ 0001h
COG1FIS1_FIS9_LENGTH                     equ 0001h
COG1FIS1_FIS9_MASK                       equ 0002h
COG1FIS1_FIS10_POSN                      equ 0002h
COG1FIS1_FIS10_POSITION                  equ 0002h
COG1FIS1_FIS10_SIZE                      equ 0001h
COG1FIS1_FIS10_LENGTH                    equ 0001h
COG1FIS1_FIS10_MASK                      equ 0004h
COG1FIS1_FIS11_POSN                      equ 0003h
COG1FIS1_FIS11_POSITION                  equ 0003h
COG1FIS1_FIS11_SIZE                      equ 0001h
COG1FIS1_FIS11_LENGTH                    equ 0001h
COG1FIS1_FIS11_MASK                      equ 0008h
COG1FIS1_FIS12_POSN                      equ 0004h
COG1FIS1_FIS12_POSITION                  equ 0004h
COG1FIS1_FIS12_SIZE                      equ 0001h
COG1FIS1_FIS12_LENGTH                    equ 0001h
COG1FIS1_FIS12_MASK                      equ 0010h
COG1FIS1_FIS13_POSN                      equ 0005h
COG1FIS1_FIS13_POSITION                  equ 0005h
COG1FIS1_FIS13_SIZE                      equ 0001h
COG1FIS1_FIS13_LENGTH                    equ 0001h
COG1FIS1_FIS13_MASK                      equ 0020h
COG1FIS1_FIS14_POSN                      equ 0006h
COG1FIS1_FIS14_POSITION                  equ 0006h
COG1FIS1_FIS14_SIZE                      equ 0001h
COG1FIS1_FIS14_LENGTH                    equ 0001h
COG1FIS1_FIS14_MASK                      equ 0040h
COG1FIS1_G1FIS8_POSN                     equ 0000h
COG1FIS1_G1FIS8_POSITION                 equ 0000h
COG1FIS1_G1FIS8_SIZE                     equ 0001h
COG1FIS1_G1FIS8_LENGTH                   equ 0001h
COG1FIS1_G1FIS8_MASK                     equ 0001h
COG1FIS1_G1FIS9_POSN                     equ 0001h
COG1FIS1_G1FIS9_POSITION                 equ 0001h
COG1FIS1_G1FIS9_SIZE                     equ 0001h
COG1FIS1_G1FIS9_LENGTH                   equ 0001h
COG1FIS1_G1FIS9_MASK                     equ 0002h
COG1FIS1_G1FIS10_POSN                    equ 0002h
COG1FIS1_G1FIS10_POSITION                equ 0002h
COG1FIS1_G1FIS10_SIZE                    equ 0001h
COG1FIS1_G1FIS10_LENGTH                  equ 0001h
COG1FIS1_G1FIS10_MASK                    equ 0004h
COG1FIS1_G1FIS11_POSN                    equ 0003h
COG1FIS1_G1FIS11_POSITION                equ 0003h
COG1FIS1_G1FIS11_SIZE                    equ 0001h
COG1FIS1_G1FIS11_LENGTH                  equ 0001h
COG1FIS1_G1FIS11_MASK                    equ 0008h
COG1FIS1_G1FIS12_POSN                    equ 0004h
COG1FIS1_G1FIS12_POSITION                equ 0004h
COG1FIS1_G1FIS12_SIZE                    equ 0001h
COG1FIS1_G1FIS12_LENGTH                  equ 0001h
COG1FIS1_G1FIS12_MASK                    equ 0010h
COG1FIS1_G1FIS13_POSN                    equ 0005h
COG1FIS1_G1FIS13_POSITION                equ 0005h
COG1FIS1_G1FIS13_SIZE                    equ 0001h
COG1FIS1_G1FIS13_LENGTH                  equ 0001h
COG1FIS1_G1FIS13_MASK                    equ 0020h
COG1FIS1_G1FIS14_POSN                    equ 0006h
COG1FIS1_G1FIS14_POSITION                equ 0006h
COG1FIS1_G1FIS14_SIZE                    equ 0001h
COG1FIS1_G1FIS14_LENGTH                  equ 0001h
COG1FIS1_G1FIS14_MASK                    equ 0040h

// Register: COG1FSIM0
#define COG1FSIM0 COG1FSIM0
COG1FSIM0                                equ 069Bh
// bitfield definitions
COG1FSIM0_FSIM0_POSN                     equ 0000h
COG1FSIM0_FSIM0_POSITION                 equ 0000h
COG1FSIM0_FSIM0_SIZE                     equ 0001h
COG1FSIM0_FSIM0_LENGTH                   equ 0001h
COG1FSIM0_FSIM0_MASK                     equ 0001h
COG1FSIM0_FSIM1_POSN                     equ 0001h
COG1FSIM0_FSIM1_POSITION                 equ 0001h
COG1FSIM0_FSIM1_SIZE                     equ 0001h
COG1FSIM0_FSIM1_LENGTH                   equ 0001h
COG1FSIM0_FSIM1_MASK                     equ 0002h
COG1FSIM0_FSIM2_POSN                     equ 0002h
COG1FSIM0_FSIM2_POSITION                 equ 0002h
COG1FSIM0_FSIM2_SIZE                     equ 0001h
COG1FSIM0_FSIM2_LENGTH                   equ 0001h
COG1FSIM0_FSIM2_MASK                     equ 0004h
COG1FSIM0_FSIM3_POSN                     equ 0003h
COG1FSIM0_FSIM3_POSITION                 equ 0003h
COG1FSIM0_FSIM3_SIZE                     equ 0001h
COG1FSIM0_FSIM3_LENGTH                   equ 0001h
COG1FSIM0_FSIM3_MASK                     equ 0008h
COG1FSIM0_FSIM4_POSN                     equ 0004h
COG1FSIM0_FSIM4_POSITION                 equ 0004h
COG1FSIM0_FSIM4_SIZE                     equ 0001h
COG1FSIM0_FSIM4_LENGTH                   equ 0001h
COG1FSIM0_FSIM4_MASK                     equ 0010h
COG1FSIM0_FSIM5_POSN                     equ 0005h
COG1FSIM0_FSIM5_POSITION                 equ 0005h
COG1FSIM0_FSIM5_SIZE                     equ 0001h
COG1FSIM0_FSIM5_LENGTH                   equ 0001h
COG1FSIM0_FSIM5_MASK                     equ 0020h
COG1FSIM0_FSIM6_POSN                     equ 0006h
COG1FSIM0_FSIM6_POSITION                 equ 0006h
COG1FSIM0_FSIM6_SIZE                     equ 0001h
COG1FSIM0_FSIM6_LENGTH                   equ 0001h
COG1FSIM0_FSIM6_MASK                     equ 0040h
COG1FSIM0_FSIM7_POSN                     equ 0007h
COG1FSIM0_FSIM7_POSITION                 equ 0007h
COG1FSIM0_FSIM7_SIZE                     equ 0001h
COG1FSIM0_FSIM7_LENGTH                   equ 0001h
COG1FSIM0_FSIM7_MASK                     equ 0080h
COG1FSIM0_G1FSIM0_POSN                   equ 0000h
COG1FSIM0_G1FSIM0_POSITION               equ 0000h
COG1FSIM0_G1FSIM0_SIZE                   equ 0001h
COG1FSIM0_G1FSIM0_LENGTH                 equ 0001h
COG1FSIM0_G1FSIM0_MASK                   equ 0001h
COG1FSIM0_G1FSIM1_POSN                   equ 0001h
COG1FSIM0_G1FSIM1_POSITION               equ 0001h
COG1FSIM0_G1FSIM1_SIZE                   equ 0001h
COG1FSIM0_G1FSIM1_LENGTH                 equ 0001h
COG1FSIM0_G1FSIM1_MASK                   equ 0002h
COG1FSIM0_G1FSIM2_POSN                   equ 0002h
COG1FSIM0_G1FSIM2_POSITION               equ 0002h
COG1FSIM0_G1FSIM2_SIZE                   equ 0001h
COG1FSIM0_G1FSIM2_LENGTH                 equ 0001h
COG1FSIM0_G1FSIM2_MASK                   equ 0004h
COG1FSIM0_G1FSIM3_POSN                   equ 0003h
COG1FSIM0_G1FSIM3_POSITION               equ 0003h
COG1FSIM0_G1FSIM3_SIZE                   equ 0001h
COG1FSIM0_G1FSIM3_LENGTH                 equ 0001h
COG1FSIM0_G1FSIM3_MASK                   equ 0008h
COG1FSIM0_G1FSIM4_POSN                   equ 0004h
COG1FSIM0_G1FSIM4_POSITION               equ 0004h
COG1FSIM0_G1FSIM4_SIZE                   equ 0001h
COG1FSIM0_G1FSIM4_LENGTH                 equ 0001h
COG1FSIM0_G1FSIM4_MASK                   equ 0010h
COG1FSIM0_G1FSIM5_POSN                   equ 0005h
COG1FSIM0_G1FSIM5_POSITION               equ 0005h
COG1FSIM0_G1FSIM5_SIZE                   equ 0001h
COG1FSIM0_G1FSIM5_LENGTH                 equ 0001h
COG1FSIM0_G1FSIM5_MASK                   equ 0020h
COG1FSIM0_G1FSIM6_POSN                   equ 0006h
COG1FSIM0_G1FSIM6_POSITION               equ 0006h
COG1FSIM0_G1FSIM6_SIZE                   equ 0001h
COG1FSIM0_G1FSIM6_LENGTH                 equ 0001h
COG1FSIM0_G1FSIM6_MASK                   equ 0040h
COG1FSIM0_G1FSIM7_POSN                   equ 0007h
COG1FSIM0_G1FSIM7_POSITION               equ 0007h
COG1FSIM0_G1FSIM7_SIZE                   equ 0001h
COG1FSIM0_G1FSIM7_LENGTH                 equ 0001h
COG1FSIM0_G1FSIM7_MASK                   equ 0080h

// Register: COG1FSIM1
#define COG1FSIM1 COG1FSIM1
COG1FSIM1                                equ 069Ch
// bitfield definitions
COG1FSIM1_FSIM8_POSN                     equ 0000h
COG1FSIM1_FSIM8_POSITION                 equ 0000h
COG1FSIM1_FSIM8_SIZE                     equ 0001h
COG1FSIM1_FSIM8_LENGTH                   equ 0001h
COG1FSIM1_FSIM8_MASK                     equ 0001h
COG1FSIM1_FSIM9_POSN                     equ 0001h
COG1FSIM1_FSIM9_POSITION                 equ 0001h
COG1FSIM1_FSIM9_SIZE                     equ 0001h
COG1FSIM1_FSIM9_LENGTH                   equ 0001h
COG1FSIM1_FSIM9_MASK                     equ 0002h
COG1FSIM1_FSIM10_POSN                    equ 0002h
COG1FSIM1_FSIM10_POSITION                equ 0002h
COG1FSIM1_FSIM10_SIZE                    equ 0001h
COG1FSIM1_FSIM10_LENGTH                  equ 0001h
COG1FSIM1_FSIM10_MASK                    equ 0004h
COG1FSIM1_FSIM11_POSN                    equ 0003h
COG1FSIM1_FSIM11_POSITION                equ 0003h
COG1FSIM1_FSIM11_SIZE                    equ 0001h
COG1FSIM1_FSIM11_LENGTH                  equ 0001h
COG1FSIM1_FSIM11_MASK                    equ 0008h
COG1FSIM1_FSIM12_POSN                    equ 0004h
COG1FSIM1_FSIM12_POSITION                equ 0004h
COG1FSIM1_FSIM12_SIZE                    equ 0001h
COG1FSIM1_FSIM12_LENGTH                  equ 0001h
COG1FSIM1_FSIM12_MASK                    equ 0010h
COG1FSIM1_FSIM13_POSN                    equ 0005h
COG1FSIM1_FSIM13_POSITION                equ 0005h
COG1FSIM1_FSIM13_SIZE                    equ 0001h
COG1FSIM1_FSIM13_LENGTH                  equ 0001h
COG1FSIM1_FSIM13_MASK                    equ 0020h
COG1FSIM1_FSIM14_POSN                    equ 0006h
COG1FSIM1_FSIM14_POSITION                equ 0006h
COG1FSIM1_FSIM14_SIZE                    equ 0001h
COG1FSIM1_FSIM14_LENGTH                  equ 0001h
COG1FSIM1_FSIM14_MASK                    equ 0040h
COG1FSIM1_G1FSIM8_POSN                   equ 0000h
COG1FSIM1_G1FSIM8_POSITION               equ 0000h
COG1FSIM1_G1FSIM8_SIZE                   equ 0001h
COG1FSIM1_G1FSIM8_LENGTH                 equ 0001h
COG1FSIM1_G1FSIM8_MASK                   equ 0001h
COG1FSIM1_G1FSIM9_POSN                   equ 0001h
COG1FSIM1_G1FSIM9_POSITION               equ 0001h
COG1FSIM1_G1FSIM9_SIZE                   equ 0001h
COG1FSIM1_G1FSIM9_LENGTH                 equ 0001h
COG1FSIM1_G1FSIM9_MASK                   equ 0002h
COG1FSIM1_G1FSIM10_POSN                  equ 0002h
COG1FSIM1_G1FSIM10_POSITION              equ 0002h
COG1FSIM1_G1FSIM10_SIZE                  equ 0001h
COG1FSIM1_G1FSIM10_LENGTH                equ 0001h
COG1FSIM1_G1FSIM10_MASK                  equ 0004h
COG1FSIM1_G1FSIM11_POSN                  equ 0003h
COG1FSIM1_G1FSIM11_POSITION              equ 0003h
COG1FSIM1_G1FSIM11_SIZE                  equ 0001h
COG1FSIM1_G1FSIM11_LENGTH                equ 0001h
COG1FSIM1_G1FSIM11_MASK                  equ 0008h
COG1FSIM1_G1FSIM12_POSN                  equ 0004h
COG1FSIM1_G1FSIM12_POSITION              equ 0004h
COG1FSIM1_G1FSIM12_SIZE                  equ 0001h
COG1FSIM1_G1FSIM12_LENGTH                equ 0001h
COG1FSIM1_G1FSIM12_MASK                  equ 0010h
COG1FSIM1_G1FSIM13_POSN                  equ 0005h
COG1FSIM1_G1FSIM13_POSITION              equ 0005h
COG1FSIM1_G1FSIM13_SIZE                  equ 0001h
COG1FSIM1_G1FSIM13_LENGTH                equ 0001h
COG1FSIM1_G1FSIM13_MASK                  equ 0020h
COG1FSIM1_G1FSIM14_POSN                  equ 0006h
COG1FSIM1_G1FSIM14_POSITION              equ 0006h
COG1FSIM1_G1FSIM14_SIZE                  equ 0001h
COG1FSIM1_G1FSIM14_LENGTH                equ 0001h
COG1FSIM1_G1FSIM14_MASK                  equ 0040h

