GopalSaraf/Practicals/PSDL/include/proc/pic16lf1764.inc
// Register: COG1ASD0
#define COG1ASD0 COG1ASD0
COG1ASD0                                 equ 069Dh
// bitfield definitions
COG1ASD0_ASDAC_POSN                      equ 0002h
COG1ASD0_ASDAC_POSITION                  equ 0002h
COG1ASD0_ASDAC_SIZE                      equ 0002h
COG1ASD0_ASDAC_LENGTH                    equ 0002h
COG1ASD0_ASDAC_MASK                      equ 000Ch
COG1ASD0_ASDBD_POSN                      equ 0004h
COG1ASD0_ASDBD_POSITION                  equ 0004h
COG1ASD0_ASDBD_SIZE                      equ 0002h
COG1ASD0_ASDBD_LENGTH                    equ 0002h
COG1ASD0_ASDBD_MASK                      equ 0030h
COG1ASD0_ASREN_POSN                      equ 0006h
COG1ASD0_ASREN_POSITION                  equ 0006h
COG1ASD0_ASREN_SIZE                      equ 0001h
COG1ASD0_ASREN_LENGTH                    equ 0001h
COG1ASD0_ASREN_MASK                      equ 0040h
COG1ASD0_ASE_POSN                        equ 0007h
COG1ASD0_ASE_POSITION                    equ 0007h
COG1ASD0_ASE_SIZE                        equ 0001h
COG1ASD0_ASE_LENGTH                      equ 0001h
COG1ASD0_ASE_MASK                        equ 0080h
COG1ASD0_ASDAC0_POSN                     equ 0002h
COG1ASD0_ASDAC0_POSITION                 equ 0002h
COG1ASD0_ASDAC0_SIZE                     equ 0001h
COG1ASD0_ASDAC0_LENGTH                   equ 0001h
COG1ASD0_ASDAC0_MASK                     equ 0004h
COG1ASD0_ASDAC1_POSN                     equ 0003h
COG1ASD0_ASDAC1_POSITION                 equ 0003h
COG1ASD0_ASDAC1_SIZE                     equ 0001h
COG1ASD0_ASDAC1_LENGTH                   equ 0001h
COG1ASD0_ASDAC1_MASK                     equ 0008h
COG1ASD0_ASDBD0_POSN                     equ 0004h
COG1ASD0_ASDBD0_POSITION                 equ 0004h
COG1ASD0_ASDBD0_SIZE                     equ 0001h
COG1ASD0_ASDBD0_LENGTH                   equ 0001h
COG1ASD0_ASDBD0_MASK                     equ 0010h
COG1ASD0_ASDBD1_POSN                     equ 0005h
COG1ASD0_ASDBD1_POSITION                 equ 0005h
COG1ASD0_ASDBD1_SIZE                     equ 0001h
COG1ASD0_ASDBD1_LENGTH                   equ 0001h
COG1ASD0_ASDBD1_MASK                     equ 0020h
COG1ASD0_ARSEN_POSN                      equ 0006h
COG1ASD0_ARSEN_POSITION                  equ 0006h
COG1ASD0_ARSEN_SIZE                      equ 0001h
COG1ASD0_ARSEN_LENGTH                    equ 0001h
COG1ASD0_ARSEN_MASK                      equ 0040h
COG1ASD0_G1ASDAC_POSN                    equ 0002h
COG1ASD0_G1ASDAC_POSITION                equ 0002h
COG1ASD0_G1ASDAC_SIZE                    equ 0002h
COG1ASD0_G1ASDAC_LENGTH                  equ 0002h
COG1ASD0_G1ASDAC_MASK                    equ 000Ch
COG1ASD0_G1ASDBD_POSN                    equ 0004h
COG1ASD0_G1ASDBD_POSITION                equ 0004h
COG1ASD0_G1ASDBD_SIZE                    equ 0002h
COG1ASD0_G1ASDBD_LENGTH                  equ 0002h
COG1ASD0_G1ASDBD_MASK                    equ 0030h
COG1ASD0_G1ARSEN_POSN                    equ 0006h
COG1ASD0_G1ARSEN_POSITION                equ 0006h
COG1ASD0_G1ARSEN_SIZE                    equ 0001h
COG1ASD0_G1ARSEN_LENGTH                  equ 0001h
COG1ASD0_G1ARSEN_MASK                    equ 0040h
COG1ASD0_G1ASE_POSN                      equ 0007h
COG1ASD0_G1ASE_POSITION                  equ 0007h
COG1ASD0_G1ASE_SIZE                      equ 0001h
COG1ASD0_G1ASE_LENGTH                    equ 0001h
COG1ASD0_G1ASE_MASK                      equ 0080h
COG1ASD0_G1ASDAC0_POSN                   equ 0002h
COG1ASD0_G1ASDAC0_POSITION               equ 0002h
COG1ASD0_G1ASDAC0_SIZE                   equ 0001h
COG1ASD0_G1ASDAC0_LENGTH                 equ 0001h
COG1ASD0_G1ASDAC0_MASK                   equ 0004h
COG1ASD0_G1ASDAC1_POSN                   equ 0003h
COG1ASD0_G1ASDAC1_POSITION               equ 0003h
COG1ASD0_G1ASDAC1_SIZE                   equ 0001h
COG1ASD0_G1ASDAC1_LENGTH                 equ 0001h
COG1ASD0_G1ASDAC1_MASK                   equ 0008h
COG1ASD0_G1ASDBD0_POSN                   equ 0004h
COG1ASD0_G1ASDBD0_POSITION               equ 0004h
COG1ASD0_G1ASDBD0_SIZE                   equ 0001h
COG1ASD0_G1ASDBD0_LENGTH                 equ 0001h
COG1ASD0_G1ASDBD0_MASK                   equ 0010h
COG1ASD0_G1ASDBD1_POSN                   equ 0005h
COG1ASD0_G1ASDBD1_POSITION               equ 0005h
COG1ASD0_G1ASDBD1_SIZE                   equ 0001h
COG1ASD0_G1ASDBD1_LENGTH                 equ 0001h
COG1ASD0_G1ASDBD1_MASK                   equ 0020h
COG1ASD0_G1ASREN_POSN                    equ 0006h
COG1ASD0_G1ASREN_POSITION                equ 0006h
COG1ASD0_G1ASREN_SIZE                    equ 0001h
COG1ASD0_G1ASREN_LENGTH                  equ 0001h
COG1ASD0_G1ASREN_MASK                    equ 0040h

// Register: COG1ASD1
#define COG1ASD1 COG1ASD1
COG1ASD1                                 equ 069Eh
// bitfield definitions
COG1ASD1_AS0E_POSN                       equ 0000h
COG1ASD1_AS0E_POSITION                   equ 0000h
COG1ASD1_AS0E_SIZE                       equ 0001h
COG1ASD1_AS0E_LENGTH                     equ 0001h
COG1ASD1_AS0E_MASK                       equ 0001h
COG1ASD1_AS1E_POSN                       equ 0001h
COG1ASD1_AS1E_POSITION                   equ 0001h
COG1ASD1_AS1E_SIZE                       equ 0001h
COG1ASD1_AS1E_LENGTH                     equ 0001h
COG1ASD1_AS1E_MASK                       equ 0002h
COG1ASD1_AS2E_POSN                       equ 0002h
COG1ASD1_AS2E_POSITION                   equ 0002h
COG1ASD1_AS2E_SIZE                       equ 0001h
COG1ASD1_AS2E_LENGTH                     equ 0001h
COG1ASD1_AS2E_MASK                       equ 0004h
COG1ASD1_AS3E_POSN                       equ 0003h
COG1ASD1_AS3E_POSITION                   equ 0003h
COG1ASD1_AS3E_SIZE                       equ 0001h
COG1ASD1_AS3E_LENGTH                     equ 0001h
COG1ASD1_AS3E_MASK                       equ 0008h
COG1ASD1_AS4E_POSN                       equ 0004h
COG1ASD1_AS4E_POSITION                   equ 0004h
COG1ASD1_AS4E_SIZE                       equ 0001h
COG1ASD1_AS4E_LENGTH                     equ 0001h
COG1ASD1_AS4E_MASK                       equ 0010h
COG1ASD1_AS5E_POSN                       equ 0005h
COG1ASD1_AS5E_POSITION                   equ 0005h
COG1ASD1_AS5E_SIZE                       equ 0001h
COG1ASD1_AS5E_LENGTH                     equ 0001h
COG1ASD1_AS5E_MASK                       equ 0020h
COG1ASD1_AS6E_POSN                       equ 0006h
COG1ASD1_AS6E_POSITION                   equ 0006h
COG1ASD1_AS6E_SIZE                       equ 0001h
COG1ASD1_AS6E_LENGTH                     equ 0001h
COG1ASD1_AS6E_MASK                       equ 0040h
COG1ASD1_AS7E_POSN                       equ 0007h
COG1ASD1_AS7E_POSITION                   equ 0007h
COG1ASD1_AS7E_SIZE                       equ 0001h
COG1ASD1_AS7E_LENGTH                     equ 0001h
COG1ASD1_AS7E_MASK                       equ 0080h
COG1ASD1_G1AS0E_POSN                     equ 0000h
COG1ASD1_G1AS0E_POSITION                 equ 0000h
COG1ASD1_G1AS0E_SIZE                     equ 0001h
COG1ASD1_G1AS0E_LENGTH                   equ 0001h
COG1ASD1_G1AS0E_MASK                     equ 0001h
COG1ASD1_G1AS1E_POSN                     equ 0001h
COG1ASD1_G1AS1E_POSITION                 equ 0001h
COG1ASD1_G1AS1E_SIZE                     equ 0001h
COG1ASD1_G1AS1E_LENGTH                   equ 0001h
COG1ASD1_G1AS1E_MASK                     equ 0002h
COG1ASD1_G1AS2E_POSN                     equ 0002h
COG1ASD1_G1AS2E_POSITION                 equ 0002h
COG1ASD1_G1AS2E_SIZE                     equ 0001h
COG1ASD1_G1AS2E_LENGTH                   equ 0001h
COG1ASD1_G1AS2E_MASK                     equ 0004h
COG1ASD1_G1AS3E_POSN                     equ 0003h
COG1ASD1_G1AS3E_POSITION                 equ 0003h
COG1ASD1_G1AS3E_SIZE                     equ 0001h
COG1ASD1_G1AS3E_LENGTH                   equ 0001h
COG1ASD1_G1AS3E_MASK                     equ 0008h
COG1ASD1_G1AS4E_POSN                     equ 0004h
COG1ASD1_G1AS4E_POSITION                 equ 0004h
COG1ASD1_G1AS4E_SIZE                     equ 0001h
COG1ASD1_G1AS4E_LENGTH                   equ 0001h
COG1ASD1_G1AS4E_MASK                     equ 0010h
COG1ASD1_G1AS5E_POSN                     equ 0005h
COG1ASD1_G1AS5E_POSITION                 equ 0005h
COG1ASD1_G1AS5E_SIZE                     equ 0001h
COG1ASD1_G1AS5E_LENGTH                   equ 0001h
COG1ASD1_G1AS5E_MASK                     equ 0020h
COG1ASD1_G1AS6E_POSN                     equ 0006h
COG1ASD1_G1AS6E_POSITION                 equ 0006h
COG1ASD1_G1AS6E_SIZE                     equ 0001h
COG1ASD1_G1AS6E_LENGTH                   equ 0001h
COG1ASD1_G1AS6E_MASK                     equ 0040h
COG1ASD1_G1AS7E_POSN                     equ 0007h
COG1ASD1_G1AS7E_POSITION                 equ 0007h
COG1ASD1_G1AS7E_SIZE                     equ 0001h
COG1ASD1_G1AS7E_LENGTH                   equ 0001h
COG1ASD1_G1AS7E_MASK                     equ 0080h

// Register: COG1STR
#define COG1STR COG1STR
COG1STR                                  equ 069Fh
// bitfield definitions
COG1STR_STRA_POSN                        equ 0000h
COG1STR_STRA_POSITION                    equ 0000h
COG1STR_STRA_SIZE                        equ 0001h
COG1STR_STRA_LENGTH                      equ 0001h
COG1STR_STRA_MASK                        equ 0001h
COG1STR_STRB_POSN                        equ 0001h
COG1STR_STRB_POSITION                    equ 0001h
COG1STR_STRB_SIZE                        equ 0001h
COG1STR_STRB_LENGTH                      equ 0001h
COG1STR_STRB_MASK                        equ 0002h
COG1STR_STRC_POSN                        equ 0002h
COG1STR_STRC_POSITION                    equ 0002h
COG1STR_STRC_SIZE                        equ 0001h
COG1STR_STRC_LENGTH                      equ 0001h
COG1STR_STRC_MASK                        equ 0004h
COG1STR_STRD_POSN                        equ 0003h
COG1STR_STRD_POSITION                    equ 0003h
COG1STR_STRD_SIZE                        equ 0001h
COG1STR_STRD_LENGTH                      equ 0001h
COG1STR_STRD_MASK                        equ 0008h
COG1STR_SDATA_POSN                       equ 0004h
COG1STR_SDATA_POSITION                   equ 0004h
COG1STR_SDATA_SIZE                       equ 0001h
COG1STR_SDATA_LENGTH                     equ 0001h
COG1STR_SDATA_MASK                       equ 0010h
COG1STR_SDATB_POSN                       equ 0005h
COG1STR_SDATB_POSITION                   equ 0005h
COG1STR_SDATB_SIZE                       equ 0001h
COG1STR_SDATB_LENGTH                     equ 0001h
COG1STR_SDATB_MASK                       equ 0020h
COG1STR_SDATC_POSN                       equ 0006h
COG1STR_SDATC_POSITION                   equ 0006h
COG1STR_SDATC_SIZE                       equ 0001h
COG1STR_SDATC_LENGTH                     equ 0001h
COG1STR_SDATC_MASK                       equ 0040h
COG1STR_SDATD_POSN                       equ 0007h
COG1STR_SDATD_POSITION                   equ 0007h
COG1STR_SDATD_SIZE                       equ 0001h
COG1STR_SDATD_LENGTH                     equ 0001h
COG1STR_SDATD_MASK                       equ 0080h
COG1STR_G1STRA_POSN                      equ 0000h
COG1STR_G1STRA_POSITION                  equ 0000h
COG1STR_G1STRA_SIZE                      equ 0001h
COG1STR_G1STRA_LENGTH                    equ 0001h
COG1STR_G1STRA_MASK                      equ 0001h
COG1STR_G1STRB_POSN                      equ 0001h
COG1STR_G1STRB_POSITION                  equ 0001h
COG1STR_G1STRB_SIZE                      equ 0001h
COG1STR_G1STRB_LENGTH                    equ 0001h
COG1STR_G1STRB_MASK                      equ 0002h
COG1STR_G1STRC_POSN                      equ 0002h
COG1STR_G1STRC_POSITION                  equ 0002h
COG1STR_G1STRC_SIZE                      equ 0001h
COG1STR_G1STRC_LENGTH                    equ 0001h
COG1STR_G1STRC_MASK                      equ 0004h
COG1STR_G1STRD_POSN                      equ 0003h
COG1STR_G1STRD_POSITION                  equ 0003h
COG1STR_G1STRD_SIZE                      equ 0001h
COG1STR_G1STRD_LENGTH                    equ 0001h
COG1STR_G1STRD_MASK                      equ 0008h
COG1STR_G1SDATA_POSN                     equ 0004h
COG1STR_G1SDATA_POSITION                 equ 0004h
COG1STR_G1SDATA_SIZE                     equ 0001h
COG1STR_G1SDATA_LENGTH                   equ 0001h
COG1STR_G1SDATA_MASK                     equ 0010h
COG1STR_G1SDATB_POSN                     equ 0005h
COG1STR_G1SDATB_POSITION                 equ 0005h
COG1STR_G1SDATB_SIZE                     equ 0001h
COG1STR_G1SDATB_LENGTH                   equ 0001h
COG1STR_G1SDATB_MASK                     equ 0020h
COG1STR_G1SDATC_POSN                     equ 0006h
COG1STR_G1SDATC_POSITION                 equ 0006h
COG1STR_G1SDATC_SIZE                     equ 0001h
COG1STR_G1SDATC_LENGTH                   equ 0001h
COG1STR_G1SDATC_MASK                     equ 0040h
COG1STR_G1SDATD_POSN                     equ 0007h
COG1STR_G1SDATD_POSITION                 equ 0007h
COG1STR_G1SDATD_SIZE                     equ 0001h
COG1STR_G1SDATD_LENGTH                   equ 0001h
COG1STR_G1SDATD_MASK                     equ 0080h

// Register: PRG1RTSS
#define PRG1RTSS PRG1RTSS
PRG1RTSS                                 equ 0794h
// bitfield definitions
PRG1RTSS_RTSS_POSN                       equ 0000h
PRG1RTSS_RTSS_POSITION                   equ 0000h
PRG1RTSS_RTSS_SIZE                       equ 0008h
PRG1RTSS_RTSS_LENGTH                     equ 0008h
PRG1RTSS_RTSS_MASK                       equ 00FFh
PRG1RTSS_RTSS0_POSN                      equ 0000h
PRG1RTSS_RTSS0_POSITION                  equ 0000h
PRG1RTSS_RTSS0_SIZE                      equ 0001h
PRG1RTSS_RTSS0_LENGTH                    equ 0001h
PRG1RTSS_RTSS0_MASK                      equ 0001h
PRG1RTSS_RTSS1_POSN                      equ 0001h
PRG1RTSS_RTSS1_POSITION                  equ 0001h
PRG1RTSS_RTSS1_SIZE                      equ 0001h
PRG1RTSS_RTSS1_LENGTH                    equ 0001h
PRG1RTSS_RTSS1_MASK                      equ 0002h
PRG1RTSS_RTSS2_POSN                      equ 0002h
PRG1RTSS_RTSS2_POSITION                  equ 0002h
PRG1RTSS_RTSS2_SIZE                      equ 0001h
PRG1RTSS_RTSS2_LENGTH                    equ 0001h
PRG1RTSS_RTSS2_MASK                      equ 0004h
PRG1RTSS_RTSS3_POSN                      equ 0003h
PRG1RTSS_RTSS3_POSITION                  equ 0003h
PRG1RTSS_RTSS3_SIZE                      equ 0001h
PRG1RTSS_RTSS3_LENGTH                    equ 0001h
PRG1RTSS_RTSS3_MASK                      equ 0008h
PRG1RTSS_RG1RTSS0_POSN                   equ 0000h
PRG1RTSS_RG1RTSS0_POSITION               equ 0000h
PRG1RTSS_RG1RTSS0_SIZE                   equ 0001h
PRG1RTSS_RG1RTSS0_LENGTH                 equ 0001h
PRG1RTSS_RG1RTSS0_MASK                   equ 0001h
PRG1RTSS_RG1RTSS1_POSN                   equ 0001h
PRG1RTSS_RG1RTSS1_POSITION               equ 0001h
PRG1RTSS_RG1RTSS1_SIZE                   equ 0001h
PRG1RTSS_RG1RTSS1_LENGTH                 equ 0001h
PRG1RTSS_RG1RTSS1_MASK                   equ 0002h
PRG1RTSS_RG1RTSS2_POSN                   equ 0002h
PRG1RTSS_RG1RTSS2_POSITION               equ 0002h
PRG1RTSS_RG1RTSS2_SIZE                   equ 0001h
PRG1RTSS_RG1RTSS2_LENGTH                 equ 0001h
PRG1RTSS_RG1RTSS2_MASK                   equ 0004h
PRG1RTSS_RG1RTSS3_POSN                   equ 0003h
PRG1RTSS_RG1RTSS3_POSITION               equ 0003h
PRG1RTSS_RG1RTSS3_SIZE                   equ 0001h
PRG1RTSS_RG1RTSS3_LENGTH                 equ 0001h
PRG1RTSS_RG1RTSS3_MASK                   equ 0008h

// Register: PRG1FTSS
#define PRG1FTSS PRG1FTSS
PRG1FTSS                                 equ 0795h
// bitfield definitions
PRG1FTSS_FTSS_POSN                       equ 0000h
PRG1FTSS_FTSS_POSITION                   equ 0000h
PRG1FTSS_FTSS_SIZE                       equ 0008h
PRG1FTSS_FTSS_LENGTH                     equ 0008h
PRG1FTSS_FTSS_MASK                       equ 00FFh
PRG1FTSS_FTSS0_POSN                      equ 0000h
PRG1FTSS_FTSS0_POSITION                  equ 0000h
PRG1FTSS_FTSS0_SIZE                      equ 0001h
PRG1FTSS_FTSS0_LENGTH                    equ 0001h
PRG1FTSS_FTSS0_MASK                      equ 0001h
PRG1FTSS_FTSS1_POSN                      equ 0001h
PRG1FTSS_FTSS1_POSITION                  equ 0001h
PRG1FTSS_FTSS1_SIZE                      equ 0001h
PRG1FTSS_FTSS1_LENGTH                    equ 0001h
PRG1FTSS_FTSS1_MASK                      equ 0002h
PRG1FTSS_FTSS2_POSN                      equ 0002h
PRG1FTSS_FTSS2_POSITION                  equ 0002h
PRG1FTSS_FTSS2_SIZE                      equ 0001h
PRG1FTSS_FTSS2_LENGTH                    equ 0001h
PRG1FTSS_FTSS2_MASK                      equ 0004h
PRG1FTSS_FTSS3_POSN                      equ 0003h
PRG1FTSS_FTSS3_POSITION                  equ 0003h
PRG1FTSS_FTSS3_SIZE                      equ 0001h
PRG1FTSS_FTSS3_LENGTH                    equ 0001h
PRG1FTSS_FTSS3_MASK                      equ 0008h
PRG1FTSS_RG1FTSS0_POSN                   equ 0000h
PRG1FTSS_RG1FTSS0_POSITION               equ 0000h
PRG1FTSS_RG1FTSS0_SIZE                   equ 0001h
PRG1FTSS_RG1FTSS0_LENGTH                 equ 0001h
PRG1FTSS_RG1FTSS0_MASK                   equ 0001h
PRG1FTSS_RG1FTSS1_POSN                   equ 0001h
PRG1FTSS_RG1FTSS1_POSITION               equ 0001h
PRG1FTSS_RG1FTSS1_SIZE                   equ 0001h
PRG1FTSS_RG1FTSS1_LENGTH                 equ 0001h
PRG1FTSS_RG1FTSS1_MASK                   equ 0002h
PRG1FTSS_RG1FTSS2_POSN                   equ 0002h
PRG1FTSS_RG1FTSS2_POSITION               equ 0002h
PRG1FTSS_RG1FTSS2_SIZE                   equ 0001h
PRG1FTSS_RG1FTSS2_LENGTH                 equ 0001h
PRG1FTSS_RG1FTSS2_MASK                   equ 0004h
PRG1FTSS_RG1FTSS3_POSN                   equ 0003h
PRG1FTSS_RG1FTSS3_POSITION               equ 0003h
PRG1FTSS_RG1FTSS3_SIZE                   equ 0001h
PRG1FTSS_RG1FTSS3_LENGTH                 equ 0001h
PRG1FTSS_RG1FTSS3_MASK                   equ 0008h

// Register: PRG1INS
#define PRG1INS PRG1INS
PRG1INS                                  equ 0796h
// bitfield definitions
PRG1INS_INS_POSN                         equ 0000h
PRG1INS_INS_POSITION                     equ 0000h
PRG1INS_INS_SIZE                         equ 0008h
PRG1INS_INS_LENGTH                       equ 0008h
PRG1INS_INS_MASK                         equ 00FFh
PRG1INS_INS0_POSN                        equ 0000h
PRG1INS_INS0_POSITION                    equ 0000h
PRG1INS_INS0_SIZE                        equ 0001h
PRG1INS_INS0_LENGTH                      equ 0001h
PRG1INS_INS0_MASK                        equ 0001h
PRG1INS_INS1_POSN                        equ 0001h
PRG1INS_INS1_POSITION                    equ 0001h
PRG1INS_INS1_SIZE                        equ 0001h
PRG1INS_INS1_LENGTH                      equ 0001h
PRG1INS_INS1_MASK                        equ 0002h
PRG1INS_INS2_POSN                        equ 0002h
PRG1INS_INS2_POSITION                    equ 0002h
PRG1INS_INS2_SIZE                        equ 0001h
PRG1INS_INS2_LENGTH                      equ 0001h
PRG1INS_INS2_MASK                        equ 0004h
PRG1INS_INS3_POSN                        equ 0003h
PRG1INS_INS3_POSITION                    equ 0003h
PRG1INS_INS3_SIZE                        equ 0001h
PRG1INS_INS3_LENGTH                      equ 0001h
PRG1INS_INS3_MASK                        equ 0008h
PRG1INS_RG1INS0_POSN                     equ 0000h
PRG1INS_RG1INS0_POSITION                 equ 0000h
PRG1INS_RG1INS0_SIZE                     equ 0001h
PRG1INS_RG1INS0_LENGTH                   equ 0001h
PRG1INS_RG1INS0_MASK                     equ 0001h
PRG1INS_RG1INS1_POSN                     equ 0001h
PRG1INS_RG1INS1_POSITION                 equ 0001h
PRG1INS_RG1INS1_SIZE                     equ 0001h
PRG1INS_RG1INS1_LENGTH                   equ 0001h
PRG1INS_RG1INS1_MASK                     equ 0002h
PRG1INS_RG1INS2_POSN                     equ 0002h
PRG1INS_RG1INS2_POSITION                 equ 0002h
PRG1INS_RG1INS2_SIZE                     equ 0001h
PRG1INS_RG1INS2_LENGTH                   equ 0001h
PRG1INS_RG1INS2_MASK                     equ 0004h
PRG1INS_RG1INS3_POSN                     equ 0003h
PRG1INS_RG1INS3_POSITION                 equ 0003h
PRG1INS_RG1INS3_SIZE                     equ 0001h
PRG1INS_RG1INS3_LENGTH                   equ 0001h
PRG1INS_RG1INS3_MASK                     equ 0008h

