GopalSaraf/Practicals/PSDL/include/proc/pic16lf1764.inc
// Register: PWMLD
#define PWMLD PWMLD
PWMLD                                    equ 0D8Fh
// bitfield definitions
PWMLD_MPWM5LD_POSN                       equ 0004h
PWMLD_MPWM5LD_POSITION                   equ 0004h
PWMLD_MPWM5LD_SIZE                       equ 0001h
PWMLD_MPWM5LD_LENGTH                     equ 0001h
PWMLD_MPWM5LD_MASK                       equ 0010h

// Register: PWMOUT
#define PWMOUT PWMOUT
PWMOUT                                   equ 0D90h
// bitfield definitions
PWMOUT_MPWM5OUT_POSN                     equ 0004h
PWMOUT_MPWM5OUT_POSITION                 equ 0004h
PWMOUT_MPWM5OUT_SIZE                     equ 0001h
PWMOUT_MPWM5OUT_LENGTH                   equ 0001h
PWMOUT_MPWM5OUT_MASK                     equ 0010h

// Register: PWM5PHL
#define PWM5PHL PWM5PHL
PWM5PHL                                  equ 0D91h
// bitfield definitions
PWM5PHL_PH_POSN                          equ 0000h
PWM5PHL_PH_POSITION                      equ 0000h
PWM5PHL_PH_SIZE                          equ 0008h
PWM5PHL_PH_LENGTH                        equ 0008h
PWM5PHL_PH_MASK                          equ 00FFh
PWM5PHL_PWM5PHL0_POSN                    equ 0000h
PWM5PHL_PWM5PHL0_POSITION                equ 0000h
PWM5PHL_PWM5PHL0_SIZE                    equ 0001h
PWM5PHL_PWM5PHL0_LENGTH                  equ 0001h
PWM5PHL_PWM5PHL0_MASK                    equ 0001h
PWM5PHL_PWM5PHL1_POSN                    equ 0001h
PWM5PHL_PWM5PHL1_POSITION                equ 0001h
PWM5PHL_PWM5PHL1_SIZE                    equ 0001h
PWM5PHL_PWM5PHL1_LENGTH                  equ 0001h
PWM5PHL_PWM5PHL1_MASK                    equ 0002h
PWM5PHL_PWM5PHL2_POSN                    equ 0002h
PWM5PHL_PWM5PHL2_POSITION                equ 0002h
PWM5PHL_PWM5PHL2_SIZE                    equ 0001h
PWM5PHL_PWM5PHL2_LENGTH                  equ 0001h
PWM5PHL_PWM5PHL2_MASK                    equ 0004h
PWM5PHL_PWM5PHL3_POSN                    equ 0003h
PWM5PHL_PWM5PHL3_POSITION                equ 0003h
PWM5PHL_PWM5PHL3_SIZE                    equ 0001h
PWM5PHL_PWM5PHL3_LENGTH                  equ 0001h
PWM5PHL_PWM5PHL3_MASK                    equ 0008h
PWM5PHL_PWM5PHL4_POSN                    equ 0004h
PWM5PHL_PWM5PHL4_POSITION                equ 0004h
PWM5PHL_PWM5PHL4_SIZE                    equ 0001h
PWM5PHL_PWM5PHL4_LENGTH                  equ 0001h
PWM5PHL_PWM5PHL4_MASK                    equ 0010h
PWM5PHL_PWM5PHL5_POSN                    equ 0005h
PWM5PHL_PWM5PHL5_POSITION                equ 0005h
PWM5PHL_PWM5PHL5_SIZE                    equ 0001h
PWM5PHL_PWM5PHL5_LENGTH                  equ 0001h
PWM5PHL_PWM5PHL5_MASK                    equ 0020h
PWM5PHL_PWM5PHL6_POSN                    equ 0006h
PWM5PHL_PWM5PHL6_POSITION                equ 0006h
PWM5PHL_PWM5PHL6_SIZE                    equ 0001h
PWM5PHL_PWM5PHL6_LENGTH                  equ 0001h
PWM5PHL_PWM5PHL6_MASK                    equ 0040h
PWM5PHL_PWM5PHL7_POSN                    equ 0007h
PWM5PHL_PWM5PHL7_POSITION                equ 0007h
PWM5PHL_PWM5PHL7_SIZE                    equ 0001h
PWM5PHL_PWM5PHL7_LENGTH                  equ 0001h
PWM5PHL_PWM5PHL7_MASK                    equ 0080h
PWM5PHL_PWM5PHL_POSN                     equ 0000h
PWM5PHL_PWM5PHL_POSITION                 equ 0000h
PWM5PHL_PWM5PHL_SIZE                     equ 0008h
PWM5PHL_PWM5PHL_LENGTH                   equ 0008h
PWM5PHL_PWM5PHL_MASK                     equ 00FFh

// Register: PWM5PHH
#define PWM5PHH PWM5PHH
PWM5PHH                                  equ 0D92h
// bitfield definitions
PWM5PHH_PH_POSN                          equ 0000h
PWM5PHH_PH_POSITION                      equ 0000h
PWM5PHH_PH_SIZE                          equ 0008h
PWM5PHH_PH_LENGTH                        equ 0008h
PWM5PHH_PH_MASK                          equ 00FFh
PWM5PHH_PWM5PHH0_POSN                    equ 0000h
PWM5PHH_PWM5PHH0_POSITION                equ 0000h
PWM5PHH_PWM5PHH0_SIZE                    equ 0001h
PWM5PHH_PWM5PHH0_LENGTH                  equ 0001h
PWM5PHH_PWM5PHH0_MASK                    equ 0001h
PWM5PHH_PWM5PHH1_POSN                    equ 0001h
PWM5PHH_PWM5PHH1_POSITION                equ 0001h
PWM5PHH_PWM5PHH1_SIZE                    equ 0001h
PWM5PHH_PWM5PHH1_LENGTH                  equ 0001h
PWM5PHH_PWM5PHH1_MASK                    equ 0002h
PWM5PHH_PWM5PHH2_POSN                    equ 0002h
PWM5PHH_PWM5PHH2_POSITION                equ 0002h
PWM5PHH_PWM5PHH2_SIZE                    equ 0001h
PWM5PHH_PWM5PHH2_LENGTH                  equ 0001h
PWM5PHH_PWM5PHH2_MASK                    equ 0004h
PWM5PHH_PWM5PHH3_POSN                    equ 0003h
PWM5PHH_PWM5PHH3_POSITION                equ 0003h
PWM5PHH_PWM5PHH3_SIZE                    equ 0001h
PWM5PHH_PWM5PHH3_LENGTH                  equ 0001h
PWM5PHH_PWM5PHH3_MASK                    equ 0008h
PWM5PHH_PWM5PHH4_POSN                    equ 0004h
PWM5PHH_PWM5PHH4_POSITION                equ 0004h
PWM5PHH_PWM5PHH4_SIZE                    equ 0001h
PWM5PHH_PWM5PHH4_LENGTH                  equ 0001h
PWM5PHH_PWM5PHH4_MASK                    equ 0010h
PWM5PHH_PWM5PHH5_POSN                    equ 0005h
PWM5PHH_PWM5PHH5_POSITION                equ 0005h
PWM5PHH_PWM5PHH5_SIZE                    equ 0001h
PWM5PHH_PWM5PHH5_LENGTH                  equ 0001h
PWM5PHH_PWM5PHH5_MASK                    equ 0020h
PWM5PHH_PWM5PHH6_POSN                    equ 0006h
PWM5PHH_PWM5PHH6_POSITION                equ 0006h
PWM5PHH_PWM5PHH6_SIZE                    equ 0001h
PWM5PHH_PWM5PHH6_LENGTH                  equ 0001h
PWM5PHH_PWM5PHH6_MASK                    equ 0040h
PWM5PHH_PWM5PHH7_POSN                    equ 0007h
PWM5PHH_PWM5PHH7_POSITION                equ 0007h
PWM5PHH_PWM5PHH7_SIZE                    equ 0001h
PWM5PHH_PWM5PHH7_LENGTH                  equ 0001h
PWM5PHH_PWM5PHH7_MASK                    equ 0080h
PWM5PHH_PWM5PHH_POSN                     equ 0000h
PWM5PHH_PWM5PHH_POSITION                 equ 0000h
PWM5PHH_PWM5PHH_SIZE                     equ 0008h
PWM5PHH_PWM5PHH_LENGTH                   equ 0008h
PWM5PHH_PWM5PHH_MASK                     equ 00FFh

