GopalSaraf/Practicals/PSDL/include/proc/pic16lf1764.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ABDEN                            BANKMASK(BAUD1CON), 0
#define ABDOVF                           BANKMASK(BAUD1CON), 7
#define ACKDT                            BANKMASK(SSP1CON2), 5
#define ACKEN                            BANKMASK(SSP1CON2), 4
#define ACKSTAT                          BANKMASK(SSP1CON2), 6
#define ACKTIM                           BANKMASK(SSP1CON3), 7
#define ADD0                             BANKMASK(SSP1ADD), 0
#define ADD1                             BANKMASK(SSP1ADD), 1
#define ADD2                             BANKMASK(SSP1ADD), 2
#define ADD3                             BANKMASK(SSP1ADD), 3
#define ADD4                             BANKMASK(SSP1ADD), 4
#define ADD5                             BANKMASK(SSP1ADD), 5
#define ADD6                             BANKMASK(SSP1ADD), 6
#define ADD7                             BANKMASK(SSP1ADD), 7
#define ADDEN                            BANKMASK(RC1STA), 3
#define ADFM                             BANKMASK(ADCON1), 7
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADNREF                           BANKMASK(ADCON1), 2
#define ADON                             BANKMASK(ADCON0), 0
#define ADPREF0                          BANKMASK(ADCON1), 0
#define ADPREF1                          BANKMASK(ADCON1), 1
#define AHEN                             BANKMASK(SSP1CON3), 1
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define ARSEN                            BANKMASK(COG1ASD0), 6
#define AS0E                             BANKMASK(COG1ASD1), 0
#define AS1E                             BANKMASK(COG1ASD1), 1
#define AS2E                             BANKMASK(COG1ASD1), 2
#define AS3E                             BANKMASK(COG1ASD1), 3
#define AS4E                             BANKMASK(COG1ASD1), 4
#define AS5E                             BANKMASK(COG1ASD1), 5
#define AS6E                             BANKMASK(COG1ASD1), 6
#define AS7E                             BANKMASK(COG1ASD1), 7
#define ASDAC0                           BANKMASK(COG1ASD0), 2
#define ASDAC1                           BANKMASK(COG1ASD0), 3
#define ASDBD0                           BANKMASK(COG1ASD0), 4
#define ASDBD1                           BANKMASK(COG1ASD0), 5
#define ASE                              BANKMASK(COG1ASD0), 7
#define ASREN                            BANKMASK(COG1ASD0), 6
#define BCL1IE                           BANKMASK(PIE2), 3
#define BCL1IF                           BANKMASK(PIR2), 3
#define BF                               BANKMASK(SSP1STAT), 0
#define BLKF0                            BANKMASK(COG1BLKF), 0
#define BLKF1                            BANKMASK(COG1BLKF), 1
#define BLKF2                            BANKMASK(COG1BLKF), 2
#define BLKF3                            BANKMASK(COG1BLKF), 3
#define BLKF4                            BANKMASK(COG1BLKF), 4
#define BLKF5                            BANKMASK(COG1BLKF), 5
#define BLKR0                            BANKMASK(COG1BLKR), 0
#define BLKR1                            BANKMASK(COG1BLKR), 1
#define BLKR2                            BANKMASK(COG1BLKR), 2
#define BLKR3                            BANKMASK(COG1BLKR), 3
#define BLKR4                            BANKMASK(COG1BLKR), 4
#define BLKR5                            BANKMASK(COG1BLKR), 5
#define BOEN                             BANKMASK(SSP1CON3), 4
#define BORFS                            BANKMASK(BORCON), 6
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUD1CON), 3
#define BRGH                             BANKMASK(TX1STA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BUF0                             BANKMASK(SSP1BUF), 0
#define BUF1                             BANKMASK(SSP1BUF), 1
#define BUF2                             BANKMASK(SSP1BUF), 2
#define BUF3                             BANKMASK(SSP1BUF), 3
#define BUF4                             BANKMASK(SSP1BUF), 4
#define BUF5                             BANKMASK(SSP1BUF), 5
#define BUF6                             BANKMASK(SSP1BUF), 6
#define BUF7                             BANKMASK(SSP1BUF), 7
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1INTN                           BANKMASK(CM1CON1), 0
#define C1INTP                           BANKMASK(CM1CON1), 1
#define C1NCH0                           BANKMASK(CM1NSEL), 0
#define C1NCH1                           BANKMASK(CM1NSEL), 1
#define C1NCH2                           BANKMASK(CM1NSEL), 2
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1PCH0                           BANKMASK(CM1PSEL), 0
#define C1PCH1                           BANKMASK(CM1PSEL), 1
#define C1PCH2                           BANKMASK(CM1PSEL), 2
#define C1PCH3                           BANKMASK(CM1PSEL), 3
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1TSEL0                          BANKMASK(CCPTMRS), 0
#define C1TSEL1                          BANKMASK(CCPTMRS), 1
#define C1ZLF                            BANKMASK(CM1CON0), 3
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define C2INTN                           BANKMASK(CM2CON1), 0
#define C2INTP                           BANKMASK(CM2CON1), 1
#define C2NCH0                           BANKMASK(CM2NSEL), 0
#define C2NCH1                           BANKMASK(CM2NSEL), 1
#define C2NCH2                           BANKMASK(CM2NSEL), 2
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2OUT                            BANKMASK(CM2CON0), 6
#define C2PCH0                           BANKMASK(CM2PSEL), 0
#define C2PCH1                           BANKMASK(CM2PSEL), 1
#define C2PCH2                           BANKMASK(CM2PSEL), 2
#define C2PCH3                           BANKMASK(CM2PSEL), 3
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2ZLF                            BANKMASK(CM2CON0), 3
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE1), 2
#define CCP1IF                           BANKMASK(PIR1), 2
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCPIE                            BANKMASK(PIE1), 2
#define CCPIF                            BANKMASK(PIR1), 2
#define CFGS                             BANKMASK(PMCON1), 6
#define CH0                              BANKMASK(MD1CARH), 0
#define CH1                              BANKMASK(MD1CARH), 1
#define CH2                              BANKMASK(MD1CARH), 2
#define CH3                              BANKMASK(MD1CARH), 3
#define CHPOL                            BANKMASK(MD1CON1), 5
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CHS4                             BANKMASK(ADCON0), 6
#define CHSYNC                           BANKMASK(MD1CON1), 4
#define CKE                              BANKMASK(SSP1STAT), 6
#define CKP                              BANKMASK(SSP1CON1), 4
#define CL0                              BANKMASK(MD1CARL), 0
#define CL1                              BANKMASK(MD1CARL), 1
#define CL2                              BANKMASK(MD1CARL), 2
#define CL3                              BANKMASK(MD1CARL), 3
#define CLC1IE                           BANKMASK(PIE3), 0
#define CLC1IF                           BANKMASK(PIR3), 0
#define CLC2IE                           BANKMASK(PIE3), 1
#define CLC2IF                           BANKMASK(PIR3), 1
#define CLC3IE                           BANKMASK(PIE3), 2
#define CLC3IF                           BANKMASK(PIR3), 2
#define CLPOL                            BANKMASK(MD1CON1), 1
#define CLSYNC                           BANKMASK(MD1CON1), 0
#define COG1IF                           BANKMASK(PIR3), 5
#define COGIE                            BANKMASK(PIE3), 5
#define CREN                             BANKMASK(RC1STA), 4
#define CSRC                             BANKMASK(TX1STA), 7
#define CTS0                             BANKMASK(CCP1CAP), 0
#define CTS1                             BANKMASK(CCP1CAP), 1
#define CTS2                             BANKMASK(CCP1CAP), 2
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DAC1EN                           BANKMASK(DAC1CON0), 7
#define DAC1FM                           BANKMASK(DAC1CON0), 6
#define DAC1LD                           BANKMASK(DACLD), 0
#define DAC1NSS0                         BANKMASK(DAC1CON0), 0
#define DAC1OE1                          BANKMASK(DAC1CON0), 5
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3
#define DAC1R0                           BANKMASK(DAC1REFL), 0
#define DAC1R1                           BANKMASK(DAC1REFL), 1
#define DAC1R10                          BANKMASK(DAC1REFH), 2
#define DAC1R11                          BANKMASK(DAC1REFH), 3
#define DAC1R12                          BANKMASK(DAC1REFH), 4
#define DAC1R13                          BANKMASK(DAC1REFH), 5
#define DAC1R14                          BANKMASK(DAC1REFH), 6
#define DAC1R15                          BANKMASK(DAC1REFH), 7
#define DAC1R2                           BANKMASK(DAC1REFL), 2
#define DAC1R3                           BANKMASK(DAC1REFL), 3
#define DAC1R4                           BANKMASK(DAC1REFL), 4
#define DAC1R5                           BANKMASK(DAC1REFL), 5
#define DAC1R6                           BANKMASK(DAC1REFL), 6
#define DAC1R7                           BANKMASK(DAC1REFL), 7
#define DAC1R8                           BANKMASK(DAC1REFH), 0
#define DAC1R9                           BANKMASK(DAC1REFH), 1
#define DAC1REF0                         BANKMASK(DAC1REFL), 0
#define DAC1REF1                         BANKMASK(DAC1REFL), 1
#define DAC1REF10                        BANKMASK(DAC1REFH), 2
#define DAC1REF11                        BANKMASK(DAC1REFH), 3
#define DAC1REF12                        BANKMASK(DAC1REFH), 4
#define DAC1REF13                        BANKMASK(DAC1REFH), 5
#define DAC1REF14                        BANKMASK(DAC1REFH), 6
#define DAC1REF15                        BANKMASK(DAC1REFH), 7
#define DAC1REF2                         BANKMASK(DAC1REFL), 2
#define DAC1REF3                         BANKMASK(DAC1REFL), 3
#define DAC1REF4                         BANKMASK(DAC1REFL), 4
#define DAC1REF5                         BANKMASK(DAC1REFL), 5
#define DAC1REF6                         BANKMASK(DAC1REFL), 6
#define DAC1REF7                         BANKMASK(DAC1REFL), 7
#define DAC1REF8                         BANKMASK(DAC1REFH), 0
#define DAC1REF9                         BANKMASK(DAC1REFH), 1
#define DAC3EN                           BANKMASK(DAC3CON0), 7
#define DAC3NSS                          BANKMASK(DAC3CON0), 0
#define DAC3OE1                          BANKMASK(DAC3CON0), 5
#define DAC3PSS0                         BANKMASK(DAC3CON0), 2
#define DAC3PSS1                         BANKMASK(DAC3CON0), 3
#define DAC3R0                           BANKMASK(DAC3REF), 0
#define DAC3R1                           BANKMASK(DAC3REF), 1
#define DAC3R2                           BANKMASK(DAC3REF), 2
#define DAC3R3                           BANKMASK(DAC3REF), 3
#define DAC3R4                           BANKMASK(DAC3REF), 4
#define DAC3REF0                         BANKMASK(DAC3REF), 0
#define DAC3REF1                         BANKMASK(DAC3REF), 1
#define DAC3REF2                         BANKMASK(DAC3REF), 2
#define DAC3REF3                         BANKMASK(DAC3REF), 3
#define DAC3REF4                         BANKMASK(DAC3REF), 4
#define DAC3REF5                         BANKMASK(DAC3REF), 5
#define DACFM                            BANKMASK(DAC1CON0), 6
#define DACNSS                           BANKMASK(DAC3CON0), 0
#define DACNSS0                          BANKMASK(DAC1CON0), 0
#define DACOE                            BANKMASK(DAC1CON0), 5
#define DACR0                            BANKMASK(DAC3REF), 0
#define DACR1                            BANKMASK(DAC3REF), 1
#define DACR2                            BANKMASK(DAC3REF), 2
#define DACR3                            BANKMASK(DAC3REF), 3
#define DACR4                            BANKMASK(DAC3REF), 4
#define DBF0                             BANKMASK(COG1DBF), 0
#define DBF1                             BANKMASK(COG1DBF), 1
#define DBF2                             BANKMASK(COG1DBF), 2
#define DBF3                             BANKMASK(COG1DBF), 3
#define DBF4                             BANKMASK(COG1DBF), 4
#define DBF5                             BANKMASK(COG1DBF), 5
#define DBR0                             BANKMASK(COG1DBR), 0
#define DBR1                             BANKMASK(COG1DBR), 1
#define DBR2                             BANKMASK(COG1DBR), 2
#define DBR3                             BANKMASK(COG1DBR), 3
#define DBR4                             BANKMASK(COG1DBR), 4
#define DBR5                             BANKMASK(COG1DBR), 5
#define DC                               BANKMASK(STATUS), 1
#define DC0                              BANKMASK(PWM3DCL), 6
#define DC1                              BANKMASK(PWM3DCL), 7
#define DC2                              BANKMASK(PWM3DCH), 0
#define DC3                              BANKMASK(PWM3DCH), 1
#define DC4                              BANKMASK(PWM3DCH), 2
#define DC5                              BANKMASK(PWM3DCH), 3
#define DC6                              BANKMASK(PWM3DCH), 4
#define DC7                              BANKMASK(PWM3DCH), 5
#define DC8                              BANKMASK(PWM3DCH), 6
#define DC9                              BANKMASK(PWM3DCH), 7
#define DCIE                             BANKMASK(PWM5INTE), 1
#define DCIF                             BANKMASK(PWM5INTF), 1
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define DHEN                             BANKMASK(SSP1CON3), 0
#define D_nA                             BANKMASK(SSP1STAT), 5
#define FDBS                             BANKMASK(COG1CON1), 6
#define FEDG                             BANKMASK(PRG1CON0), 5
#define FERR                             BANKMASK(RC1STA), 2
#define FIS0                             BANKMASK(COG1FIS0), 0
#define FIS1                             BANKMASK(COG1FIS0), 1
#define FIS10                            BANKMASK(COG1FIS1), 2
#define FIS11                            BANKMASK(COG1FIS1), 3
#define FIS12                            BANKMASK(COG1FIS1), 4
#define FIS13                            BANKMASK(COG1FIS1), 5
#define FIS14                            BANKMASK(COG1FIS1), 6
#define FIS2                             BANKMASK(COG1FIS0), 2
#define FIS3                             BANKMASK(COG1FIS0), 3
#define FIS4                             BANKMASK(COG1FIS0), 4
#define FIS5                             BANKMASK(COG1FIS0), 5
#define FIS6                             BANKMASK(COG1FIS0), 6
#define FIS7                             BANKMASK(COG1FIS0), 7
#define FIS8                             BANKMASK(COG1FIS1), 0
#define FIS9                             BANKMASK(COG1FIS1), 1
#define FM                               BANKMASK(DAC1CON0), 6
#define FMT                              BANKMASK(CCP1CON), 4
#define FPOL                             BANKMASK(PRG1CON1), 1
#define FREE                             BANKMASK(PMCON1), 4
#define FSIM0                            BANKMASK(COG1FSIM0), 0
#define FSIM1                            BANKMASK(COG1FSIM0), 1
#define FSIM10                           BANKMASK(COG1FSIM1), 2
#define FSIM11                           BANKMASK(COG1FSIM1), 3
#define FSIM12                           BANKMASK(COG1FSIM1), 4
#define FSIM13                           BANKMASK(COG1FSIM1), 5
#define FSIM14                           BANKMASK(COG1FSIM1), 6
#define FSIM2                            BANKMASK(COG1FSIM0), 2
#define FSIM3                            BANKMASK(COG1FSIM0), 3
#define FSIM4                            BANKMASK(COG1FSIM0), 4
#define FSIM5                            BANKMASK(COG1FSIM0), 5
#define FSIM6                            BANKMASK(COG1FSIM0), 6
#define FSIM7                            BANKMASK(COG1FSIM0), 7
#define FSIM8                            BANKMASK(COG1FSIM1), 0
#define FSIM9                            BANKMASK(COG1FSIM1), 1
#define FTSS0                            BANKMASK(PRG1FTSS), 0
#define FTSS1                            BANKMASK(PRG1FTSS), 1
#define FTSS2                            BANKMASK(PRG1FTSS), 2
#define FTSS3                            BANKMASK(PRG1FTSS), 3
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1ARSEN                          BANKMASK(COG1ASD0), 6
#define G1AS0E                           BANKMASK(COG1ASD1), 0
#define G1AS1E                           BANKMASK(COG1ASD1), 1
#define G1AS2E                           BANKMASK(COG1ASD1), 2
#define G1AS3E                           BANKMASK(COG1ASD1), 3
#define G1AS4E                           BANKMASK(COG1ASD1), 4
#define G1AS5E                           BANKMASK(COG1ASD1), 5
#define G1AS6E                           BANKMASK(COG1ASD1), 6
#define G1AS7E                           BANKMASK(COG1ASD1), 7
#define G1ASDAC0                         BANKMASK(COG1ASD0), 2
#define G1ASDAC1                         BANKMASK(COG1ASD0), 3
#define G1ASDBD0                         BANKMASK(COG1ASD0), 4
#define G1ASDBD1                         BANKMASK(COG1ASD0), 5
#define G1ASE                            BANKMASK(COG1ASD0), 7
#define G1ASREN                          BANKMASK(COG1ASD0), 6
#define G1BLKF0                          BANKMASK(COG1BLKF), 0
#define G1BLKF1                          BANKMASK(COG1BLKF), 1
#define G1BLKF2                          BANKMASK(COG1BLKF), 2
#define G1BLKF3                          BANKMASK(COG1BLKF), 3
#define G1BLKF4                          BANKMASK(COG1BLKF), 4
#define G1BLKF5                          BANKMASK(COG1BLKF), 5
#define G1BLKR0                          BANKMASK(COG1BLKR), 0
#define G1BLKR1                          BANKMASK(COG1BLKR), 1
#define G1BLKR2                          BANKMASK(COG1BLKR), 2
#define G1BLKR3                          BANKMASK(COG1BLKR), 3
#define G1BLKR4                          BANKMASK(COG1BLKR), 4
#define G1BLKR5                          BANKMASK(COG1BLKR), 5
#define G1CS0                            BANKMASK(COG1CON0), 3
#define G1CS1                            BANKMASK(COG1CON0), 4
#define G1DBF0                           BANKMASK(COG1DBF), 0
#define G1DBF1                           BANKMASK(COG1DBF), 1
#define G1DBF2                           BANKMASK(COG1DBF), 2
#define G1DBF3                           BANKMASK(COG1DBF), 3
#define G1DBF4                           BANKMASK(COG1DBF), 4
#define G1DBF5                           BANKMASK(COG1DBF), 5
#define G1DBR0                           BANKMASK(COG1DBR), 0
#define G1DBR1                           BANKMASK(COG1DBR), 1
#define G1DBR2                           BANKMASK(COG1DBR), 2
#define G1DBR3                           BANKMASK(COG1DBR), 3
#define G1DBR4                           BANKMASK(COG1DBR), 4
#define G1DBR5                           BANKMASK(COG1DBR), 5
#define G1EN                             BANKMASK(COG1CON0), 7
#define G1FDBS                           BANKMASK(COG1CON1), 6
#define G1FIS0                           BANKMASK(COG1FIS0), 0
#define G1FIS1                           BANKMASK(COG1FIS0), 1
#define G1FIS10                          BANKMASK(COG1FIS1), 2
#define G1FIS11                          BANKMASK(COG1FIS1), 3
#define G1FIS12                          BANKMASK(COG1FIS1), 4
#define G1FIS13                          BANKMASK(COG1FIS1), 5
#define G1FIS14                          BANKMASK(COG1FIS1), 6
#define G1FIS2                           BANKMASK(COG1FIS0), 2
#define G1FIS3                           BANKMASK(COG1FIS0), 3
#define G1FIS4                           BANKMASK(COG1FIS0), 4
#define G1FIS5                           BANKMASK(COG1FIS0), 5
#define G1FIS6                           BANKMASK(COG1FIS0), 6
#define G1FIS7                           BANKMASK(COG1FIS0), 7
#define G1FIS8                           BANKMASK(COG1FIS1), 0
#define G1FIS9                           BANKMASK(COG1FIS1), 1
#define G1FSIM0                          BANKMASK(COG1FSIM0), 0
#define G1FSIM1                          BANKMASK(COG1FSIM0), 1
#define G1FSIM10                         BANKMASK(COG1FSIM1), 2
#define G1FSIM11                         BANKMASK(COG1FSIM1), 3
#define G1FSIM12                         BANKMASK(COG1FSIM1), 4
#define G1FSIM13                         BANKMASK(COG1FSIM1), 5
#define G1FSIM14                         BANKMASK(COG1FSIM1), 6
#define G1FSIM2                          BANKMASK(COG1FSIM0), 2
#define G1FSIM3                          BANKMASK(COG1FSIM0), 3
#define G1FSIM4                          BANKMASK(COG1FSIM0), 4
